#Область СлужебныйПрограммныйИнтерфейс

#Область СобытияМодуляПриложения

// Событие модуля приложения "ПриГлобальномПоиске"
// Анализируем введенную строку на наличие команд расширенного поиска.
// 
// Параметры:
//  НеобработаннаяСтрокаПоиска - Строка - Строка, введенная пользователем или скриптом в поле глобального поиска
//  ПланПоиска - ПланГлобальногоПоиска - Текущий план выполнения глобального поиска.
Процедура ПриГлобальномПоиске(НеобработаннаяСтрокаПоиска, ПланПоиска) Экспорт
	
	ОчищеннаяСтрокаПоиска = СокрЛП(НеобработаннаяСтрокаПоиска);
	
	// Проверяем, начинается ли строка поиска с ". ." или "/ /"
	Если СтрНачинаетсяС(ОчищеннаяСтрокаПоиска, ". .") ИЛИ СтрНачинаетсяС(ОчищеннаяСтрокаПоиска, "/ /") Тогда
		ПланПоиска.Очистить();
		
		// Открываем форму поиска
		Попытка
			ОткрытьФорму("ОбщаяФорма.НОП_ФормаПоиска");
		Исключение
			Сообщить("Ошибка при открытии формы поиска: " + ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
#КонецОбласти