// Процедура для добавления записи в журнал регистрации
// Параметры:
//  Текст - Строка - Комментарий записи, который будет добавлен в журнал
//  Уровень - Строка, УровеньЖурналаРегистрации - Уровень записи (по умолчанию "Ошибка")
Процедура ДобавитьЗаписьЖР(Текст, Знач Уровень = "Ошибка") Экспорт
    // Проверяем, является ли уровень записи строкой
    // Если да, то преобразуем его в соответствующий уровень журнала регистрации
    Уровень = ?(ТипЗнч(Уровень) = Тип("Строка"), УровеньЖурналаРегистрации[Уровень], Уровень);
    
    // Уникальный ключ для записи в журнале
    КлючЗаписиЖР = "Интеллектуальный Глобальный Поиск (НОП)";
    
    // Попытка добавить запись в журнал регистрации
    Попытка
        // Вызов процедуры для записи в журнал с указанным ключом, уровнем и текстом
        ЗаписьЖурналаРегистрации(КлючЗаписиЖР, Уровень, , , Текст);
    Исключение
        // Обработка ошибок: вывод сообщения об ошибке, если запись не удалась
        Сообщить("Ошибка при добавлении записи в журнал регистрации: " + ОписаниеОшибки());
    КонецПопытки;
КонецПроцедуры

