#Область ОбработчикиСобытий

#Область ПриГлобальномПоиске

&После("ПриГлобальномПоиске")
Процедура НОП_ПриГлобальномПоиске(СтрокаПоиска, ПланПоиска)
	// Вызываем обработчик события глобального поиска
	НОП_СобытиеПриГлобальномПоиске(СтрокаПоиска, ПланПоиска);
КонецПроцедуры

#КонецОбласти
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Процедура для обработки события глобального поиска
// Параметры:
//  СтрокаПоиска - Строка, содержащая текст для поиска
//  ПланПоиска - Объект, определяющий план поиска
Процедура НОП_СобытиеПриГлобальномПоиске(СтрокаПоиска, ПланПоиска)
	Попытка
		// Обрабатываем глобальный поиск с помощью клиента
		НОП_ГлобальныйПоискКлиент.ПриГлобальномПоиске(СтрокаПоиска, ПланПоиска);
	Исключение
		// Обработка ошибки, если она возникла
		НОП_ГлобальныйПоискКлиентСервер.ОбработатьОшибку(ИнформацияОбОшибке());
	КонецПопытки;
КонецПроцедуры

#КонецОбласти
