#Область СлужебныйПрограммныйИнтерфейс

// Процедура для обработки ошибок
// Параметры:
//  ИнформацияОбОшибке - ИнформацияОбОшибке, содержащая данные об ошибке
Процедура ОбработатьОшибку(ИнформацияОбОшибке) Экспорт
    // Получаем краткое представление ошибки
    КраткоеПредставление = КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
    
    // Показываем краткое сообщение пользователю
    ПоказатьСообщениеПользователю(КраткоеПредставление);
    
    // Получаем подробное представление ошибки
    ПодробноеПредставление = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
    
    // Записываем подробное представление ошибки в журнал регистрации
    НОП_ГлобальныйПоискВызовСервера.ДобавитьЗаписьЖР(ПодробноеПредставление);
КонецПроцедуры

// Процедура для показа сообщения пользователю
// Параметры:
//  ТекстСообщения - Строка, текст сообщения для отображения
Процедура ПоказатьСообщениеПользователю(ТекстСообщения) Экспорт
    // Создаем новое сообщение для пользователя
    Сообщение = Новый СообщениеПользователю();
    Сообщение.Текст = ТекстСообщения;
    
    // Отправляем сообщение пользователю
    Попытка
        Сообщение.Сообщить();
    Исключение
        // Обработка ошибок при отправке сообщения
        Сообщить("Ошибка при отправке сообщения пользователю: " + ОписаниеОшибки());
    КонецПопытки;
КонецПроцедуры

#КонецОбласти
